Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: སྡིག་པ་ཐམས་ཅད་ཟད་པར་བྱེད་པ་ཉིད་དང་ཕྱག་རྒྱའི་དམ་ཚིག་གི་དངོས་གྲུབ་བླ་ན་མེད་པ།
en: Among all amogha mudrās, it is the supreme accomplisher of all practices and remover of all evil. It brings unsurpassed mastery of the samaya.

source: ཕྱག་རྒྱ་གཟུང་བ་ཙམ་གྱིས་མནར་མེད་པ་ཡང་སྐེམས་པར་བྱེད་པ་དམྱལ་བ་པ་རྣམས་སྐེམས་པར་བྱེད་པ་སྟེ།
en: Even the Avīci hell will dry up when this mudrā is displayed.

source: གང་གིས་གཟུང་བ་ཙམ་ལ་སོགས་པས་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་གྲོལ་བར་བྱེད་ཅིང་སྐེམས་པར་བྱེད་དོ།
en: All the hells will dry up, and the beings there will all be freed.

source: །དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་རྒྱལ་བ་དེ་རྣམས་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ།
en: The tathāgatas of the three times will cause the hells to dry up on behalf of the vidyā holder who displays this mudrā.

source: །ཕྱོགས་བཅུ་ཀུན་དུ་གཟིགས་པར་འགྱུར་ཏེ་ཐེ་ཚོམ་མེད་དོ། །དུས་གསུམ་པའི་རྒྱལ་བ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་དང་།
en: All the victors in the ten directions will keep him in their hearts; there is no doubt about this—the victorious ones of the three times and all bodhisattvas will watch over him. “

source: དེ་བཞིན་དུ་པདྨའི་ཕྱག་གི་རྟག་ཏུ་མཆོག་སྦྱིན་པ་དང་རྟག་ཏུ་མཐོང་བར་འདོད་པ་དང་། ལྷ་རྣམས་ཀྱིས་རྟག་ཏུ་སྲུང་བར་བྱེད་ཅིང་དགའ་བ་དང་།
en: Padmapāṇi will always grant him boons, and all deities will desire to see and protect him.

source: འོག་མིན་གྱི་ལྷ་དང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་ཐམས་ཅད་ཀྱིས་སྲུང་བར་བྱེད་ཅིང་ཀུན་ནས་ཡོངས་སུ་སྐྱོང་བར་བྱེད་དེ། ཐམས་ཅད་ལ་ཆོ་ག་བཞིན་དུ་བདག་ཉིད་ཀྱི་སྙིང་ལས་སྐྱེས་པའི་བུ་བཞིན་དུ་དགེ་བ་དང་ཞི་བ་དང་།
en: The gods of Tuṣita and Akaniṣṭha heavens and Śakra with the gods from the realm of Thirty-Three will protect him from every danger and guard him as if he were their own son, their own flesh and blood.

source: སྟོབས་དང་། བརྩོན་འགྲུས་ཉིད་དང་། མདངས་ཀྱང་རབ་ཏུ་འཇུག་པར་བྱེད་ཅིང་དེ་བཞིན་དུ་ཡང་ཚེ་འཕེལ་ལོ།
en: They will endow him with prosperity, peace, strength, energy, and vitality, and they will increase his lifespan.

source: །ཕྱག་རྒྱ་འདི་རྣམས་བཟུང་བས་བཀྲ་མི་ཤིས་པ་ཐམས་ཅད་ཉམས་པར་བྱེད་དོ། །བགེགས་ཐམས་ཅད་ཉམས་པར་བྱེད་ཅིང་།
en: When this mudrā is displayed, all misfortunes dissipate, and all vighnas will perish.

source: བདུད་དང་། ལོག་པར་འདྲེན་པ་དང་། གདུག་པའི་གནོད་སྦྱིན་རྣམ་པར་ཉམས་པར་བྱེད་དོ།
en: Māras, vināyakas, and wicked yakṣas will also perish, as will wicked rākṣasas and other wicked beings.

source: །གདུག་པའི་སྲིན་པོ་དང་ཡི་དགས་ཐམས་ཅད་ཀྱང་ཕྱག་རྒྱ་འཛིན་བཞིན་པའི་སྐད་ཅིག་དེ་ལ་མགོ་བོ་ཚལ་པ་བདུན་དུ་འགས་ཤིང་མིག་འབྱིན་པར་བྱེད་དོ།
en: The very moment the mudrā is displayed, their heads will split into seven pieces and their eyeballs will burst.

source: །བརྒྱ་བྱིན་དང་ཚོགས་དང་བཅས་པའི་གདུག་པ་ཐམས་ཅད་རབ་ཏུ་ཉམས་པར་བྱེད་དོ།
en: All these wicked beings will perish, including even the hosts of Śakra. “

source: །དེའི་ཕྱིར་ཡང་དག་པར་འཛིན་པར་བྱེད་པ་ལ་ལག་པའི་ཐལ་མོ་པདྨ་འདྲ་བ་པདྨ་འབྱུང་བའི་གཙུག་ཏོར་དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱས་སྡིགས་མཛུབ་ཡོངས་སུ་དཀྲིས་ལ་མཐེ་བོང་གི་སོར་མོ་དང་།
en: To form the mudrā, the vidyā holder should clasp his hands in the añjali gesture so that it resembles a lotus, and then form it into a lotus-shaped uṣṇīṣa.

source: གུང་མོའི་སོར་མོ་རབ་ཏུ་བརྐྱངས་ལ་ལྕགས་ཀྱུའི་རྣམ་པར་བཀུག་སྟེ་མིང་མེད་དང་། མཐེའུ་ཆུང་ལག་པའི་ནང་དུ་བཅུག་ནས་རྟག་ཏུ་སྙིང་གའི་གནས་སུ་གཞག་པར་བྱ་སྟེ།
en: In this mudrā of Amoghapāśa, the forefingers should be enclosed, the thumbs and the middle fingers outstretched and folded to form the shape of a hook, and the ring and small fingers enclosed within the hands.

source: འདི་ནི་དོན་ཡོད་པ་པདྨ་གཙུག་ཏོར་གྱི་རྩ་བའི་གསང་སྔགས་ཀྱི་སྔགས་དང་ཕྱག་རྒྱར་བརྗོད་དོ།
en: The vidyā holder should form this mudrā at his heart and recite the root mantra of Amogha­padmoṣṇīṣa while displaying the mudrā. “

source: །དེ་བཟུང་བ་ཙམ་དང་ཕྱག་རྒྱ་དང་། གསང་སྔགས་བརྗོད་པ་ཉིད་ཀྱིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྣམ་པར་འགྱུར་བ་དྲུག་ཏུ་གཡོས་ཏེ་ཆར་འབབ་པར་བྱེད་དོ།
en: As soon as he forms the mudrā while mindfully reciting the mantra, the earth and all the buddha fields where the buddhas of the three times dwell will quake in six different ways.

source: །མེ་ཏོག་གི་ཆར་དང་། ལྷ་རྫས་ཀྱི་གོས་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་རྣམས་མཆོད་པའི་དོན་དུ་ཀུན་ནས་ཆར་བབ་བོ། །དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་སྟོང་ཕྲག་བསྐྱེད་དོ།
en: A rain of flowers, clothes, adornments, and ornaments will fall everywhere, a divine rain that conveys offerings to the buddhas and bodhisattvas of the three times.

source: །ཕྱག་རྒྱ་དེ་བཟུང་བ་ཙམ་གྱིས་སྐད་ཅིག་དེ་ལ་ཕྱག་རྒྱ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་བྱེ་བ་སྟོང་ཕྲག་བྱེ་བའི་གྲངས་སུ་བགྲངས་པའི་ཕྱག་རྒྱ་བཅིངས་པར་འགྱུར་རོ།
en: A great deal of merit will be instantly obtained, one that is multiplied a thousandfold by merely displaying the mudrā. Displaying this mudrā is equal to displaying thousands of millions of billions of mudrās, as numerous as the grains of sand in the Gaṅgā river. “

source: །ཕྱག་རྒྱ་བཟུང་བ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་།
en: This mudrā conveys the blessing of all the tathāgatas, including the sage Vairocana.

source: དེ་བཞིན་དུ་ཐུབ་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་ཕྱག་རྒྱས་བྱིན་གྱིས་རློབ་བོ། །རི་རབ་ཀྱི་ཚད་དང་མཉམ་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རིན་པོ་ཆེའི་ཕུང་པོར་བྱས་ཏེ། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་སོ་སོ་སོ་སོ་ལ་ཕུལ་བ་དང་།
en: The vidyā holder will accumulate an amount of merit equal to that of individually offering all the tathāgatas of the three times and all the victorious ones a heap of the seven types of jewels as tall as Mount Sumeru.

source: རྒྱལ་བ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཐོབ་པའི་གྲངས་ཀྱི་ཚོགས་ཉིད་ཀྱང་ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་འདིའི་འབྲས་བུར་འགྱུར་ཏེ།
en: He will accumulate this amount of merit merely by displaying the mudrā.

source: དེ་བཞིན་གཤེགས་པས་ཉིན་མཚན་རྟག་ཏུ་རྣམ་པར་གཟིགས་པར་ཐེ་ཙོམ་མེད་དོ་ཞེས་སོ།
en: The tathāgatas will watch over him day and night; there is no doubt about this. “

source: །ཕྱག་རྒྱ་འདི་ཉིད་ལས་གཡས་པའི་མཛུབ་མོ་བརྐྱངས་ཏེ་རྩ་བའི་གསང་སྔགས་ལན་ཅིག་བརྗོད་དོ། །ཕྱག་རྒྱ་འདི་ནི་དོན་ཡོད་ཞགས་པའི་གཙུག་ཏོར་དྲི་མ་མེད་པའི་ཆུ་སྐྱེས་ཀྱི་སྟོབས་སྤྱན་རས་གཟིགས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་སྟེ།
en: If, when displaying this mudrā, the vidyā holder extends his right forefinger while mindfully repeating the root mantra once, the mudrā is called the essence of the lotus-like pure gaze of Amogha­pāśoṣṇīṣa.

source: ཐམས་ཅད་དུ་ལས་ཐམས་ཅད་ལེགས་པར་ཐོབ་པར་བྱེད་དོ།
en: It can be employed in all activities and in all situations.

source: །ཕྱག་རྒྱ་འདི་བཅིངས་པ་ཙམ་གྱིས་ཀྱང་བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་དང་སྤྱན་རས་གཟིགས་དོན་ཡོད་པ་དྲི་མ་མེད་པའི་དངོས་གྲུབ་ཏུ་ཡང་འགྱུར་རོ།
en: As soon as the vidyā holder displays this mudrā, he will complete his accumulation of merit and attain the stainless accomplishment of the amogha gaze.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཟིགས་པ་དག་པའི་སྙིང་པོའི་ཕྱག་རྒྱ་ཡང་དག་པར་འཛིན་པར་འགྱུར་རོ།
en: He will obtain the seal of the pure essence of the gaze of all the tathāgatas.

source: །སྡིག་པ་དང་ངན་འགྲོ་དང་ལོག་པར་ལྟུང་བའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: All his evil and the danger of falling into unhappy destinies will be pacified.

source: །ཕྱག་རྒྱ་འདི་བཟུང་བ་ཙམ་དང་དང་པོ་བཅིངས་པ་ཙམ་གྱིས་རི་རབ་ཆེན་པོ་ལྟར་འགྱུར་ཏེ།
en: By simply displaying this mudrā, he will immediately become as unshakable, immovable, and invincible as the great Mount Sumeru.

source: བདུད་དང་བགེགས་ལ་སོགས་པ་ཐམས་ཅད་དང་། འབྱུང་པོ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་ཀྱིས་མི་འགུལ་ཞིང་མི་གཡོ་ལ་ཟིལ་གྱིས་མི་ནོན་པར་ཡང་འགྱུར་རོ། །ཕྱིར་རྒོལ་བ་དང་དགྲའི་འཇིགས་པ་ཐམས་ཅད་ནས་ཡོངས་སུ་གྲོལ་ལོ།
en: He will be saved from all vighnas, māras, and so forth, as well as from all bhūtas, yakṣas, rākṣasas, opponents, and adversaries. “

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དྲུང་དུ་དགེ་བའི་བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོ་ཀུན་དུ་འཛིན་པར་འགྱུར་རོ།
en: He will thus plant the roots of great virtue and will accumulate the same amount of merit as if he were in the presence of hundreds of thousands of millions of tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers.

source: །དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་མངོན་སུམ་དུ་མཐོང་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: The roots of virtue will sprout for him, and he will be able to see all the tathāgatas in their bodily forms, right in front of his face.

source: །ཕྱག་རྒྱའི་གསང་བའི་ལྷག་པར་འདྲེན་པ་འདི་འཆིང་བཞིན་པ་དེ་དེ་བཞིན་གཤེགས་པའི་ཕྱག་རྒྱ་གང་ཅུང་ཟད་ཡོད་པ་དེ་མིག་གིས་གསལ་བར་མཐོང་ངོ་། །ཐམས་ཅད་དུ་རབ་ཏུ་འཆིང་ཞིང་འཛིན་པར་འགྱུར་རོ། །གང་ཡང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། ཕྱག་སྟོང་གི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། ནོར་བུའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་།
en: When this secret mudrā, the supreme guide, is displayed, it will appear to the eye as if all the mudrās of the tathāgatas that exist are being formed and displayed.

source: གླང་པོའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། དོན་ཡོད་ཞགས་པའི་ཡངས་པ་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་གང་ཡིན་པ་དང་། རྟ་མགྲིན་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། མགྲིན་སྔོན་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། གཞན་ཕྱག་རྒྱའི་དམ་ཚིག་གསང་བ་རྣམ་པ་སྣ་ཚོགས་པ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་ཕྱག་རྒྱ་འདི་གཅིག་པུ་བཅིངས་པ་ཙམ་གྱིས་དེ་རྣམས་ཐམས་ཅད་བཅིངས་པར་འགྱུར་ཞིང་ཡང་དག་པར་བཟུང་བར་འགྱུར་ལ།
en: If this mudrā is displayed just once, then the mudrā of Noble Avalokiteśvara’s illusion-like samādhi, the mudrās of the thousand-armed Avalokiteśvara, the mudrās of the jewel and elephant family maṇḍalas, the mudrās of the great and important maṇḍala of Amoghapāśa, and the mudrās of Hayagrīva, Nīlakaṇṭha, and various other secret samaya mudrās will all be displayed and take effect.

source: ཀུན་དུ་བཅངས་པ་དང་མཆོད་པར་ཡང་འགྱུར་རོ། །འདི་ནི་ཕྱག་རྒྱ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱའི་གསང་བའི་དཀྱིལ་འཁོར་དུ་གདུགས་གཅིག་པུར་གྱུར་པ་སྟེ། ཇི་ལྟར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་བཞིན་དུ་ཕྱག་རྒྱ་འདི་ནི་སྒྱུ་མ་ལྟ་བུའི་ཕྱག་རྒྱའི་རྣམ་པར་འཕྲུལ་པ་སྟེ།
en: This mudrā is a so-called single umbrella for all the mudrās in the secret maṇḍala, as it constitutes a miraculous display of Noble Avalokiteśvara’s illusion-like samādhi.

source: ལས་ཐམས་ཅད་ལ་ཕྱག་རྒྱ་འདི་སྦྱར་ན།
en: In this way, the mudrā produces the miraculous display of the illusion-like mudrā.

source: གང་དང་གང་ལ་རབ་ཏུ་སྦྱར་བ་དེ་ཐོགས་པ་མེད་པར་འགྲུབ་བོ།
en: It can be employed in every activity, and it will successfully accomplish whatever activity it is employed for. “

source: །ཕྱག་རྒྱ་འདི་ཉིད་ལས་མཛུབ་མོའི་སོར་མོ་གཉིས་བརྐྱངས་ལ་ལྕགས་ཀྱུའི་རྣམ་པ་ཙམ་དུ་བཀུག་པ་འདི་ནི་གནས་པའི་ཕྱག་རྒྱ་འདི་སྤྱན་དྲང་བ་དང་། བོད་པ་དང་ཡང་དག་པར་བསྐུལ་བ་དང་། མཆོད་པའི་སྤྲིན་ཉིད་ཀྱང་ཡིན་ཏེ། དམ་ཚིག་དང་།
en: If the vidyā holder forms the same mudrā and then extends both his index fingers and bends them to form the shape of a hook, the mudrā thus formed can be used for remaining, summoning, inviting, and inciting.

source: ཕྱག་བྱེད་པ་དང་། འཇུག་པ་དང་། བསྐོར་བ་བྱེད་པ་ཉིད་དག་གདན་དང་། ཕྱོགས་བཅིང་བ་དང་། དཀྱིལ་འཁོར་བཅིང་བ་དང་།
en: It also produces clouds of offerings and can be used to establish the samaya, greet the deity, usher it into the maṇḍala, circumambulate it, offer it a seat, bind the directions, bind the maṇḍala, create a protective boundary, and tie one’s topknot.

source: མཚམས་བཅིང་བཞེས་པ་དང་། གཙུག་ཏོར་བཅིང་བ་དང་། བདག་སྲུང་པ་དང་། གཞན་སྲུང་བ་དང་། དེ་བཞིན་ཉིད་དུ་གྲོགས་སྲུང་བ་དང་།
en: It effects one’s own protection, as well as the protection of others, including one’s assistants.

source: ཁྲུས་དང་། གོས་བགོ་བ་དང་། ཉེ་རེག་བྱེད་པ་ཉིད་དང་། སྦྱིན་སྲེག་དང་། དེ་བཞིན་དུ་སྔགས་བཟླས་པ་དང་། བདུག་པ་དང་།
en: The vidyā holder should take a bath, put on his clothes, and perform the auxiliary ablutions.

source: མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གཏོར་མ་འབུལ་བའི་ལས་དང་།
en: He should offer homa, recite the mantra, and offer incense, flowers, fragrances, garlands, and scented oils.

source: དེ་བཞིན་དུ་གཤེགས་སུ་གསོལ་བ་ཉིད་དང་།
en: He should also offer a bali and then dismiss the deity. “

source: དེ་བཞིན་དུ་འགུགས་པ་སྟེ། ཐམས་ཅད་ལ་ཕྱག་རྒྱ་འདི་བྱའོ།
en: This mudrā can also be used to bring any target into one’s presence.

source: །ས་བཅུ་གནོན་པའི་ཕྱག་རྒྱ་དང་། གསང་སྔགས་བཅུ་ལ་ཡང་ཕྱག་རྒྱ་འདི་བྱ་སྟེ། སྙིང་པོ་དང་། ཉེ་བའི་སྙིང་པོ་འདི་ཉིད་ཀྱང་ཐམས་ཅད་དུ་སྦྱར་བར་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ཉིད་དང་།
en: It can establish the vidyā holder on the tenth bodhisattva level, and so it can be used in combination with the ten mantras.

source: མངོན་པར་དབང་བསྐུར་བ་དང་། རིགས་ཀྱི་གསང་སྔགས་དང་། གཞན་ལ་ཡང་ཕྱག་རྒྱ་འདི་དང་། ཕྱག་རྒྱ་འདིའི་སྙིང་པོ་དང་། ཉེ་བའི་སྙིང་པོ་ཉིད་ཀྱང་རབ་ཏུ་སྦྱར་བར་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོའི་མངོན་པར་དབང་བསྐུར་བ་དང་།
en: It can be universally employed with the heart mantra, the auxiliary heart mantra, the consecration mantra of Krodharāja, and the family mantra.

source: རིགས་ཀྱི་གསང་སྔགས་གཞན་ལ་ཡང་གནས་ཐམས་ཅད་དུ་སྦྱར་བར་བྱའོ་ཞེས་སོ།
en: It can be employed with these mantras in any way whatsoever.

source: །ཕྱག་རྒྱའི་ཆོ་ག་དང་སྒྲུབ་ཐབས་ཀྱི་ཆོ་གའོ།། །།
en: Such are the instructions regarding the practice procedure of this mudrā. “

source: ཕྱག་རྒྱ་གསུམ་ནི་རྣམ་སྤྲུལ་པ། །ཕྱག་རྒྱ་དེ་དག་ཡང་དག་བསྟན། །བཟང་པོ་གཙོ་བོ་ཆེན་པོ་སྟེ། །མཆོག་དང་རབ་མཆོག་ཉིད་ཡིན་ནོ། །ཕྱག་རྒྱ་གྱ་ནོམ་བླ་ན་མེད།
en: This mudrā, called the three mudrās, Is described as the miraculous display, The divine mudrā, the superior mudrā, The best mudrā, the excellent mudrā, “The perfect mudrā, and the peerless mudrā.

source: །འཇིག་རྟེན་འདྲེན་པས་བསྟན་པ་ཡིན། །སྙིང་པོ་དེ་ཉིད་གྱུར་པ་སྟེ། །ཕྱག་རྒྱ་དཀྱིལ་ཆེན་ལེགས་པར་བསྒྲུབས། །སངས་རྒྱས་བྱང་ཆུབ་ཕྱག་རྒྱ་འདི། །དུས་གསུམ་གཏོགས་པའི་དེ་བཞིན་གཤེགས།
en: In the great collection of mudrās, This mudrā was taught by the guides of the world For the realization of the essential nature. “

source: །ཀུན་གྱིས་འདི་ནི་བྱིན་གྱིས་བརླབས། །ཕྱག་རྒྱ་དུས་གསུམ་གཤེགས་པ་ཡི། །དེ་བཞིན་གཤེགས་པས་ཕྱག་རྒྱར་བཏབ། །དེ་བཞིན་སངས་རྒྱས་ཆེན་པོ་པ། །ཐུབ་པ་སྣང་མཛད་ཀྱིས་ཀྱང་བཏབ།
en: This mudrā brings the realization of buddhahood, Has been blessed by all the tathāgatas of the three times, And was instituted by all the tathāgatas And by the sage Mahāvairocana. “

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་དཀྱིལ་གྱི། །གསང་ཉིད་ཀུན་དུ་བཞུགས་པ་ཡིན།
en: This secret mudrā belongs To the entire tathāgata family.

source: །དེ་ནས་གསང་སྔགས་གསང་བ་ཉིད། །དངོས་གྲུབ་བླ་མེད་བཤད་པར་བྱ།
en: Now I will teach the secret mantras That bring about the supreme accomplishment. [

source: །ཨོྃ་ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ་པདྨ་ཨུཥྞཱི་ཥ་སཱ་དྷ་ཡ།
en: 271] “Oṁ, Padmoṣṇīṣa, the amogha essence! Summon! Take control!

source: བྷ་ར་ས་མ་བྷ་ར།
en: Bring! Collect!

source: མ་ཧཱ་པདྨེ་སྭཱ་ཧཱ།
en: O great lotus, svāhā! “

source: བསྐུར་བ་ལ་དང་སྤྱན་དྲང་བ་དང་། གཤེགས་སུ་གསོལ་བའི་སྔགས་སོ།
en: This is the mantra for summoning, inviting, and inciting. [

source: །ཨོྃ་པདྨ་ཨུཥྞཱི་ཥ་ཨ་མོ་གྷ་མཎྜ་ལེ་ཧཱུྃ།
en: 272] “Oṁ, the amogha maṇḍala of Padmoṣṇīṣa, hūṁ! “

source: དཀྱིལ་འཁོར་བསྲུང་བ་དང་། ཕྱོགས་བཅིང་བ་དང་། མཚམས་བཅད་པ་དང་།
en: This is the mantra for binding the maṇḍala, binding the directions, and creating the protective boundary.

source: དྲི་ཆབ་དང་། ཆུ་དང་། ཡུངས་ཀར་བསྲེས་པ་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་བྱའོ།
en: One should use perfumed water together with mustard seeds, both incanted with this mantra seven times. [

source: །ཨོྃ་པདྨ་ཤི་ཁ་རེ་ཧཱུྃ།
en: 273] “Oṁ, the tip of the lotus, hūṁ! “

source: སྤྱི་གཙུག་བཅིང་བ་ཡིན་ཏེ།
en: This is the mantra for tying the topknot.

source: ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་སོ།
en: It should be recited seven times. [

source: །ཨོྃ་པདྨ་ཨུཥྞཱི་ཥ་ཨ་མོ་གྷ་ཛ་ལེ་ཧཱུྃ།
en: 274] “Oṁ, amogha water of Padmoṣṇīṣa, hūṁ! “

source: ཁྲུས་བྱ་བའི་སྔགས་ཏེ་ཡུངས་ཀར་དང་། ཆུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་སོ།
en: This mantra is for bathing; it should be recited seven times over the mustard seeds and water. [

source: །ཨོྃ་བི་མ་ལེ་ཤུད་དྷེ་ཧཱུྃ།
en: 275] “Oṁ, stainless purity, hūṁ! “

source: །ཨོྃ་སཾ་ཙྪ་ད་ཡ་པདྨེ་ཧཱུྃ།
en: 276] “Oṁ, cover me, O lotus, hūṁ! “

source: གོས་བགོ་བའི་སྔགས་སོ།
en: This mantra is for putting on clothes. [

source: །ཨོྃ་མི་ལི་མི་ལི་ཤུད་དྷེ་ཧཱུྃ།
en: 277] “Oṁ, mili mili, you are pure, hūṁ! “

source: ལུས་ཡོངས་སུ་སྦྱང་བའི་སྔགས་ཏེ།
en: This mantra is for purifying the body.

source: བའི་རྣམ་ལྔའི་ཆུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་སོ།
en: One should use water that has been mixed with the five products of the cow and incanted with this mantra seven times. [

source: །ཨོྃ་པདྨ་ཨུཥྞཱི་ཥ་ཨ་མོ་གྷ་ཨ་བྷི་ཥིཉྩ་ཨཱཏྨ་ཤུད་དྷེ་ཧཱུྃ།
en: 278] “Oṁ, Padmoṣṇīṣa! Please amogha-sprinkle me! You are intrinsically pure, hūṁ! “

source: དབང་བསྐུར་བའི་སྔགས་ཏེ་དྲི་ཆབ་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་སོ།
en: This mantra is for consecrating. One should use perfumed water incanted with this mantra seven times. [

source: །ཨོྃ་པདྨ་ཀ་བ་ཙེ་དྲྀ་ཌྷ་བ་ན་དྷ་ཧཱུྃ་ཛྭ་ལ་སྭཱ་ཧཱ།
en: 278a] “Oṁ, lotus armor, tightly fastened, hūṁ! Blaze!

source: གོ་ཆའི་སྔགས་ཏེ།
en: Svāhā! “

source: ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་པས་སོ།
en: This is the armor mantra; it should be recited twenty-one times. [

source: །ཨོྃ་བཛྲ་ཨ་དྷིཥྛཱ་ན་པདྨེ་ཧཱུྃ།
en: 278b] “Oṁ, O lotus blessed by the vajra, hūṁ! “

source: བྱིན་གྱིས་བརླབ་པའི་སྔགས་སོ།
en: This is the mantra of the vajra blessing. [

source: །ཨོཾ་ཛྭ་ལ་པདྨེ་དྷ་ར་དྷ་ར་ཧཱུྃ།
en: 278c] “Oṁ, blazing lotus! Support, support, hūṁ! “

source: སའི་སྔགས་སོ།
en: This is the mantra of the earth. [

source: །ཨོྃ་པདྨ་ཨ་ཤྲ་ཡ།
en: 278d] “Oṁ, lotus seat!

source: རུ་ཧ་ཙ་ལ་ཙ་ལ་ཧཱུྃ།
en: Rahu, cala cala, hūṁ! “

source: གདན་གྱི་སྔགས་སོ།
en: This is the mantra of the seat. [

source: །ཨོྃ་དི་བྱ་པདྨེ་མྃ།
en: 278e] “Oṁ, divine lotus, hūṁ! “

source: མེ་ཏོག་གི་སྔགས་སོ།
en: This is the mantra of flowers. [

source: །ཨོྃ་པདྨ་ཨ་མོ་གྷ་སཾ་བ་ར་ནི་སྭཱ་ཧཱ།
en: 278f] “Oṁ, O lotus, amogha-envelope! Svāhā! “

source: བདུག་སྤོས་ཀྱི་སྔགས་སོ།
en: This is the mantra of incense. [

source: །ཨོྃ་པདྨ་གན་དྷ་ཨཱི་ཤྭ་རི་ཧཱུྃ།
en: 279] “Oṁ, O lotus-goddess of perfume, hūṁ! “

source: བྱུག་སྤོས་ཀྱི་སྔགས་སོ།
en: This is the mantra of perfume and scented oils. [

source: །ཨོྃ་པདྨ་པྲ་ཀིརྞ་དྷ་ར་ཎི་སོ་མེ་སྭཱ་ཧཱ།
en: 280] “Oṁ, overspread with lotuses like the earth, svāhā! “

source: འབྲས་ཡོས་དང་མེ་ཏོག་དགྲམ་བའི་སྔགས་སོ།
en: This mantra is for strewing parched rice and mustard seeds. [

source: །ཨོྃ་པདྨ་ཛ་ལེ་སུ་གན་དྷ་བ་ཏི་ཧཱུྃ།
en: 281] “Oṁ, lotus water with a beautiful scent, hūṁ! “

source: མཆོད་ཡོན་དབུལ་བའི་སྔགས་སོ།
en: This mantra is for offering argha water for the feet. [

source: །ཨོྃ་ཤུ་ག་ལ་བཱ་རེ་རཱ་ས་ཡ་ཤུད་དྷེ་ཧཱུྃ།
en: 282] “Oṁ, the best of ‘white’ foods, pure as ambrosia, hūṁ! “

source: ལྷ་བཤོས་ཀྱི་སྔགས་སོ།
en: This mantra is for offering food. [

source: །ཨོྃ་སུ་རུ་སུ་རུ་ཀུ་མ་བྷ་བ་ཏི་སྭཱ་ཧཱ།
en: 283] “Oṁ, suru suru, the lady of the jars, svāhā! “

source: གཏོར་མའི་སྔགས་སོ།
en: This mantra is for offering bali. [

source: །ཨོྃ་མ་ཧཱ་པདྨ་ཨ་ཤི་ནི་སཱ་དྷ་ཡ་ཧཱུྃ།
en: 284] “Oṁ, O lotus cook, take control, hūṁ! “

source: གཏོར་མ་ཟར་གཞུག་པའི་སྔགས་སོ།
en: This mantra is for offering a bali of food. [

source: །ཨོཾ་ཕ་ལ་བི་ཤུད་དྷེ་པྲ་བ་ར་ཧཱུྃ།
en: 285] “Oṁ, please accept these fine fruits, hūṁ! “

source: འབྲས་བུའི་སྔགས་སོ།
en: This mantra is for offering fruit. [286] “Oṁ, please accept these flowers!

source: །ཨོྃ་པྲ་བར་པུཥྤེ་ཛ་ཡ་སྭཱ་ཧཱ།
en: Be victorious, svāhā! “

source: ཕྲེང་བའི་སྔགས་སོ།
en: This mantra is for offering garlands. [

source: །ཨོྃ་ཛྭ་ལ་ཛྭ་ལ་ཡ་ར་ས་ར་གྲྀ་ཎི་ཧཱུྃ།
en: 287] “Oṁ, burn, blaze! You bring the best flavors, hūṁ! “

source: གཏོར་མ་བཅོས་པའི་སྔགས་སོ།
en: This mantra is for offering cooked food. [

source: །ཨོཾ་པདྨ་དཱི་པ་ཡ་ཛྭ་ལ་ཧཱུྃ།
en: 288] “Oṁ, lotus lamp, burn, hūṁ! “

source: མར་མེའི་སྔགས་སོ།
en: This mantra is for offering lamps. [

source: །ཨོྃ་ས་མ་པདྨ་བྷུ་བ་ནེ་ཥུ་ས་ར་ཧཱུྃ།
en: 289] “Oṁ, proceed into the lotus-like house, hūṁ! “

source: འཇུག་པའི་སྔགས་སོ།
en: This mantra is for causing the deity to enter. [

source: །ཨོྃ་པདྨ་ཨུཥྞཱི་ཥ་ཨ་མོ་གྷ་མུ་ནི་ཧཱུྃ།
en: 290] “Oṁ, Padmoṣṇīṣa, the amogha sage, hūṁ! “

source: ཕྱག་བྱ་བའི་སྔགས་སོ།
en: This mantra is for greeting. [

source: །ཨོྃ་ཙཀྲ་མཎྜ་ལེ་ས་མནྟ་པདྨེ་ཧཱུྃ།
en: 291] “Oṁ, the maṇḍala circle, surrounded by a lotus, hūṁ! “

source: །ཨོྃ་ས་མནྟ་པྲ་ཀིར་ཎཱ་པདྨེ་སཾ་བྷ་ར་ཧཱུྃ།
en: 292] “Oṁ, lotuses scattered all around! Spread out, hūṁ! “

source: མེ་ཏོག་དོར་བའི་སྔགས་སོ།
en: This mantra is for casting a lotus. [

source: །ཨོྃ་པདྨ་ས་མ་ཡ་ཨུཥྞཱི་ཥ་མ་ཧཱ་ཨ་མོ་གྷ་ས་མ་ཡ་ཧཱུྃ།
en: 293] “Oṁ, O samaya of Padmoṣṇīṣa, great amogha samaya, hūṁ! “

source: ཨོཾ་ས་མནྟ་སཱ་དྷ་ར་ཎི་དྷ་ར་པདྨེ་ཧཱུྃ་ཕཊ།
en: 294] “Oṁ, O lotus supported on all sides, hūṁ phaṭ! “

source: སྐྱིལ་མོ་ཀྲུང་གི་སྔགས་སོ།
en: This is the mantra of the cross-legged posture. [

source: །ཨོྃ་ཨ་པ་རི་མི་ཏཱ་ཛྭ་ལ་པདྨེ་ཧཱུྃ།
en: 295] “Oṁ, O lotus of the infinite flame, hūṁ! “

source: བགྲང་ཕྲེང་གི་སྔགས་སོ།
en: This is the mantra of the rosary beads. [

source: །ཨོྃ་ཤ་ཏ་ས་ཧ་སྲ་ཛྭ་ལི་ཏ་པདྨེ་དྷ་ར་དྷ་ར་ཧཱུྃ།
en: 296] “Oṁ, O lotus of a hundred thousand flames! Hold, hold, hūṁ! “

source: བཟླས་བརྗོད་ཀྱི་སྔགས་སོ།
en: This is the mantra of mantra-recitation. [

source: །ཨོྃ་ས་མནྟ་ད་ཪྵ་པདྨེ་ཧཱུྃ།
en: 297] “Oṁ, O lotus of panoptic vision, hūṁ! “

source: རྨི་ལམ་གྱི་སྔགས་སོ།
en: This is the mantra of sleeping. [

source: །ཨོྃ་ས་མནྟ་རཀྵ་ར་ཀྵ་ནི་པདྨེ་ཧཱུྃ།
en: 298] “Oṁ, O lotus of universal protection, hūṁ! “

source: སྲུང་བའི་སྔགས་སོ།
en: This is the mantra of protection. [

source: །ཨོཾ་ས་མནྟ་མེ་རུ་དྲྀ་ཌྷ་སྴི་རི་ཧཱུྃ།
en: 299] “Oṁ, in your entirety you are firm and stable as Mount Sumeru, hūṁ! “

source: ར་བའི་སྔགས་སོ།
en: This is the mantra of the protective wall. [

source: །ཨོྃ་ས་མནྟ་ཛྭ་ལཱ་མ་ལ་གརྦྷེ།
en: 300] “Oṁ, you blaze within and you blaze everywhere!

source: ཛྭ་ལ་ཛྭ་ལ།
en: Blaze, blaze, O great blazing lotus!

source: མ་ཧཱ་པདྨེ་ཛྭ་ལེ་ཧཱུྃ།
en: Hūṁ! “

source: མེའི་སྔགས་སོ།
en: This is the mantra of fire. [

source: །ཨོྃ་དྷུ་རུ་དྷུ་རུ་པྲ་ས་ར། དྷུ་ས་རི་མན་ཏྲེ་སྭཱ་ཧཱ།
en: 301] “Oṁ, dhuru dhuru, stretch forth, O grey-colored one, svāhā! “

source: སྦྱིན་སྲེག་གི་སྔགས་སོ།
en: This is the mantra of burnt offering. [

source: །ཨོྃ་ས་མནྟ་པྲ་ཛྭ་ལི་ཏེ་བྷུད་དྷེ་ས་མ་ཡ་ཧཱུྃ།
en: 301a] “Oṁ, O intellect, blazing brightly in all directions! Samaya, hūṁ! “

source: སྲེག་བླུགས་ཀྱི་སྔགས་སོ།
en: This is the mantra of burnt offering. [

source: །ཨོྃ་ས་མནྟ་ཨ་བ་ལོ་ཀི་ཏ་གུ་ཧྱེ་བཱ་ཡུ་ཛཱ་བེ་པདྨ་བེ་གི་ནི་སྭཱ་ཧཱ།
en: 302] “Oṁ, swift lotus, swift as the wind, with a secret panoptic vision, svāhā! “

source: ནམ་མཁའ་ལ་འགྲོ་བའི་སྔགས་སོ།
en: This is the mantra for traveling through space. [

source: །ཨོྃ་ཤུ་བྷ་ཤ་སྟ་དྷཱ་རི་ཎི་པདྨ་བྷུ་ཛེ་ཧཱུྃ།
en: 303] “Oṁ, O lotus-born one, holding a beautiful arrow, hūṁ! “

source: མཚོན་ཆའི་སྔགས་སོ། །ཨོྃ་སམནྟ་ཨ་ཀཪྵ་ཎི་པྲ་ས་ར་གུ་ཧྱེ་ཧཱུྃ། དྲང་བའི་སྔགས་སོ། །ན་མོ་ཏྲི་བྷུ་བ་ན། ཨཱི་ཤྭ་རཱ་ཡ།
en: This is the mantra of the arrow. [

source: ལོ་ཀེ་ཤྭ་རཱ་ཡ། མ་ཧེ་ཤྭ་རཱ་ཡ། དྷ་ར་དྷ་ར། ས་མནྟ།
en: 304] “Oṁ, O universal summoner, advancing secretly, hūṁ! “

source: གུ་ཧྱེ། ཨཱ་གཙྪ་བྷ་ག་བཱ་ན། དྷི་རི་དྷི་རི།
en: 305] “Oṁ, homage to the lord of the three worlds!

source: མ་ཧཱ་བི་རི།
en: O Lokeśvara, the great lord!

source: མ་ཎི་ཀ་ན་ཀ་བཛྲ་བཻ་ཌཱུརྱ།
en: Hold, hold!

source: མ་ར་ཀ་ཏ་པདྨ་རཱ་ག །
en: You possess the secret panoptic gaze.

source: ཨིནྡྲ་ནཱི་ལེ།
en: Come, O Lord!

source: མ་ཧཱ་མུཀྟི་ཀཱ།
en: Hero, hero, great hero!

source: བི་བྷཱུ་ཥི་ཏ་ཤ་རཱི་ར།
en: Your body is adorned with jewels, gold, diamonds, beryl, emeralds, coral, sapphires, and precious pearls.

source: མ་ཧཱ་པདྨ་བྷུ་ཛ། ཨ་མོ་གྷ་པྲ་ཤ་དྷ་ར།
en: You have fine lotus arms, O holder of the unfailing noose!

source: ས་མཏྣ།
en: Your gaze is directed in all directions.

source: ཨ་བ་ལོ་ཀི་ཏ། བ་ར་དཱ་བ་ར་དཱ་ཡ་ཀ།
en: You grant boons, O boon giver!

source: ཛྭ་ལ་ཛྭ་ལ། ས་མནྟ། ཨ་བ་ལོ་ཀི་ཏ། ཨཱ་གཙྪ་ཨཱ་གཙྪ།
en: Blaze, blaze with light, O lord with a panoptic vision!

source: ཤཱི་གྷྲཱཾ་ས་མ་ཡ། མ་ནུ་སྨ་ར། བི་བི་དྷ་བེ་ཥ་དྷ་ར།
en: Remember your samaya, O wearer of many garbs!

source: ཡ་མ་བ་རུ་ཎ། ཀུ་བེ་ར། ན་མ་སྐྲྀ་ཏ།
en: Yama, Varuṇa, and Kubera pay homage to you.

source: ཨཱི་ཤྭ་ར།
en: Come swiftly, O Lord, come!

source: མ་ཧེ་ཤྭ་ར། པདྨེ་ཤྭ་ར། ཨེ་ཧི་བྷ་ག་པཱ་ན། ཤཱི་གྷྲཾ་ཨཱ་གཙྪ།
en: Remember the samaya of the maṇḍala of all the vidyās!

source: སརྦ་བིདྱཱ་མཎྜ་ལ། ས་མ་ཡ་མ་ནུ་སྨ་ར། ད་རི་ཤ་ན་སྭ་པྣ། བི་བི་དྷ་ཏེ་ཛ་དྷ་ར།
en: Show your own form, O holder of manifold splendor!

source: ས་མནྟ་རཤྨི། ཛྭ་ལ་གརྦྷ་ཤ་རཱི་ར།
en: Your body, infused with light, radiates light everywhere.
